In [1]:
import pandas as pd
a=pd.read_csv("details.csv")
a

    ID no     Name Class  Gender Dept  Salary
0       1  Neeraja    2E  Female  CSE  100000
1       2    Kittu    2A  Female  ECE   60000
2       3      Sai    2E    Male  CSE   30000
3       4  Haseena    3E  Female  EEE  100000
4       5     Mani    4E    Male  ECE   40000
5       6     Hema    5E  Female   ME   50000
6       7     Appu    6E    Male  EEE   30000
7       8  Keerthi    7E  Female  ECE   44000
8       9     Dora    8E    Male   ME   45000
9      10   Harsha    9E    Male  CSE   30005

In [3]:
print(a.groupby(["Gender"]))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001FA3E06F040>

In [8]:
b=a.groupby(["Gender"])
print(b.groups)

{'Female': [0, 1, 3, 5, 7], 'Male': [2, 4, 6, 8, 9]}

In [10]:
c=(a.groupby(["Dept","Salary"]))
c.groups

{('CSE', 30000): [2], ('CSE', 30005): [9], ('CSE', 100000): [0], ('ECE', 40000): [4], ('ECE', 44000): [7], ('ECE', 60000): [1], ('EEE', 30000): [6], ('EEE', 100000): [3], ('ME', 45000): [8], ('ME', 50000): [5]}

In [33]:
c=a.groupby(["Name","Class"])
c.groups

{('Appu', '6E'): [6], ('Dora', '8E'): [8], ('Harsha', '9E'): [9], ('Haseena', '3E'): [3], ('Hema', '5E'): [5], ('Keerthi', '7E'): [7], ('Kittu', '2A'): [1], ('Mani', '4E'): [4], ('Neeraja', '2E'): [0], ('Sai', '2E'): [2]}

In [16]:
print(a.groupby(["Salary"]).max())

         ID no     Name Class  Gender Dept
Salary
30000        7      Sai    6E    Male  EEE
30005       10   Harsha    9E    Male  CSE
40000        5     Mani    4E    Male  ECE
44000        8  Keerthi    7E  Female  ECE
45000        9     Dora    8E    Male   ME
50000        6     Hema    5E  Female   ME
60000        2    Kittu    2A  Female  ECE
100000       4  Neeraja    3E  Female  EEE

In [17]:
print(a.groupby(["Salary"]).mean())

         ID no
Salary
30000      5.0
30005     10.0
40000      5.0
44000      8.0
45000      9.0
50000      6.0
60000      2.0
100000     2.5

In [18]:
print(a.groupby(["Gender"]).max())

         ID no     Name Class Dept  Salary
Gender
Female       8  Neeraja    7E   ME  100000
Male        10      Sai    9E   ME   45000

In [19]:
print(a.groupby(["Dept"]).groups)

{'CSE': [0, 2, 9], 'ECE': [1, 4, 7], 'EEE': [3, 6], 'ME': [5, 8]}

In [27]:
b=a.groupby(["Gender"])
print(b.get_group("Female"))

    ID no     Name Class  Gender Dept  Salary
0       1  Neeraja    2E  Female  CSE  100000
1       2    Kittu    2A  Female  ECE   60000
3       4  Haseena    3E  Female  EEE  100000
5       6     Hema    5E  Female   ME   50000
7       8  Keerthi    7E  Female  ECE   44000

In [21]:
a["Gender"].value_counts()

Female    5
Male      5
Name: Gender, dtype: int64

In [22]:
a["Class"].value_counts()

2E    2
2A    1
3E    1
4E    1
5E    1
6E    1
7E    1
8E    1
9E    1
Name: Class, dtype: int64

In [23]:
a["Dept"].value_counts()

CSE    3
ECE    3
EEE    2
ME     2
Name: Dept, dtype: int64

In [25]:
a["Salary"].value_counts()

100000    2
30000     2
60000     1
40000     1
50000     1
44000     1
45000     1
30005     1
Name: Salary, dtype: int64

In [28]:
c=a.groupby(["Salary"])
print(c.get_group(100000))

    ID no     Name Class  Gender Dept  Salary
0       1  Neeraja    2E  Female  CSE  100000
3       4  Haseena    3E  Female  EEE  100000

In [29]:
d=a.groupby(["Dept"])

In [30]:
print(d.get_group("CSE"))

    ID no     Name Class  Gender Dept  Salary
0       1  Neeraja    2E  Female  CSE  100000
2       3      Sai    2E    Male  CSE   30000
9      10   Harsha    9E    Male  CSE   30005